jma-phytec/workspace-pcm-073-imxrt11xx/evkmimxrt1170_sai_cm7/codec/fsl_tlv320aic3110.c
/*
 * Copyright (c) 2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "fsl_tlv320aic3110.h"

/*******************************************************************************
 * Definitations
 ******************************************************************************/
#define TLV320AIC3110_CHECK_RET(x, status)  \
    (status) = (x);                  \
    if ((status) != kStatus_Success) \
    {                                \
        return (status);             \
    }

/*! @brief TLV320AIC3110 f2 better performance range */
#define TLV320AIC3110_PLL_F2_MIN_FREQ 90000000U
#define TLV320AIC3110_PLL_F2_MAX_FREQ 100000000U
/*! @brief TLV320AIC3110 PLLN range */
#define TLV320AIC3110_PLL_N_MIN_VALUE 6U
#define TLV320AIC3110_PLL_N_MAX_VALUE 12U
/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/
/*
 * tlv320aic3110 register cache
 * We can't read the TLV320AIC3110 register space when we are
 * using 2 wire for device control, so we cache them instead.
 */
static const uint16_t tlv320aic3110_reg[TLV320AIC3110_CACHEREGNUM] = {
    0x0097, 0x0097, 0x0000, 0x0000, 0x0000, 0x0008, 0x0000, 0x000a, 0x01c0, 0x0000, 0x00ff, 0x00ff, 0x0000, 0x0000,
    0x0000, 0x0000, 0x0000, 0x007b, 0x0100, 0x0032, 0x0000, 0x00c3, 0x00c3, 0x01c0, 0x0000, 0x0000, 0x0000, 0x0000,
    0x0000, 0x0000, 0x0000, 0x0000, 0x0100, 0x0100, 0x0050, 0x0050, 0x0050, 0x0050, 0x0000, 0x0000, 0x0000, 0x0000,
    0x0040, 0x0000, 0x0000, 0x0050, 0x0050, 0x0000, 0x0002, 0x0037, 0x004d, 0x0080, 0x0008, 0x0031, 0x0026, 0x00e9,
};

static uint16_t reg_cache[TLV320AIC3110_CACHEREGNUM];
/*******************************************************************************
 * Code
 ******************************************************************************/
static status_t TLV320AIC3110_SetInternalPllConfig(
    tlv320aic3110_handle_t *handle, uint32_t inputMclk, uint32_t outputClk, uint32_t sampleRate, uint32_t bitWidth)
{
    status_t ret   = kStatus_Success;
    uint32_t pllF2 = outputClk * 4U, pllPrescale = 0U, sysclkDiv = 1U, pllR = 0, pllN = 0, pllK = 0U, fracMode = 0U;

    /* disable PLL power */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER2, 1U, 0U), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_CLOCK1, 7U, 0U), ret);

    pllN = pllF2 / inputMclk;
    if (pllN < TLV320AIC3110_PLL_N_MIN_VALUE)
    {
        inputMclk >>= 1U;
        pllPrescale = 1;
        pllN        = pllF2 / inputMclk;
        if (pllN < TLV320AIC3110_PLL_N_MIN_VALUE)
        {
            sysclkDiv = 2U;
            pllN      = (pllF2 * sysclkDiv) / inputMclk;
        }
    }

    if ((pllN < TLV320AIC3110_PLL_N_MIN_VALUE) || (pllN > TLV320AIC3110_PLL_N_MAX_VALUE))
    {
        return kStatus_InvalidArgument;
    }

    pllR = (uint32_t)(((uint64_t)pllF2 * sysclkDiv * 1000U) / (inputMclk / 1000U));
    pllK = (uint32_t)(((1UL << 24U) * ((uint64_t)pllR - (uint64_t)pllN * 1000U * 1000U)) / 1000U / 1000U);
    if (pllK != 0U)
    {
        fracMode = 1U;
    }
    TLV320AIC3110_CHECK_RET(
        TLV320AIC3110_WriteReg(handle, TLV320AIC3110_PLL1,
                        ((uint16_t)fracMode << 5U) | ((uint16_t)pllPrescale << 4U) | ((uint16_t)pllN & 0xFU)),
        ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_PLL2, (uint16_t)(pllK >> 16U) & 0xFFU), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_PLL3, (uint16_t)(pllK >> 8U) & 0xFFU), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_PLL4, (uint16_t)pllK & 0xFFU), ret);
    /* enable PLL power */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER2, 1U, 1U), ret);

    TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_CLOCK1, 7U, ((sysclkDiv == 1U ? 0U : sysclkDiv) << 1U) | 1U), ret);

    return ret;
}

static status_t TLV320AIC3110_SetMasterClock(tlv320aic3110_handle_t *handle, uint32_t sysclk, uint32_t sampleRate, uint32_t bitWidth)
{
    uint32_t bitClockDivider = 0U, regDivider = 0U;
    status_t ret = kStatus_Success;

    bitClockDivider = (sysclk * 2U) / (sampleRate * bitWidth * 2U);

    switch (bitClockDivider)
    {
        case 2:
            regDivider = 0U;
            break;
        case 3:
            regDivider = 1U;
            break;
        case 4:
            regDivider = 2U;
            break;
        case 6:
            regDivider = 3U;
            break;
        case 8:
            regDivider = 4U;
            break;
        case 11:
            regDivider = 5U;
            break;
        case 12:
            regDivider = 6U;
            break;
        case 16:
            regDivider = 7U;
            break;
        case 22:
            regDivider = 8U;
            break;
        case 24:
            regDivider = 9U;
            break;
        case 32:
            regDivider = 10U;
            break;
        case 44:
            regDivider = 11U;
            break;
        case 48:
            regDivider = 12U;
            break;

        default:
            ret = kStatus_InvalidArgument;
            break;
    }
    if (ret == kStatus_Success)
    {
        /* configure the master bit clock divider will be better */
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_CLOCK2, TLV320AIC3110_CLOCK2_BCLK_DIV_MASK, (uint16_t)regDivider),
                         ret);
    }

    return ret;
}

status_t TLV320AIC3110_Init(tlv320aic3110_handle_t *handle, const tlv320aic3110_config_t *config)
{
    status_t ret = kStatus_Success;

    handle->config  = config;
    uint32_t sysclk = config->format.mclk_HZ;

    /* i2c bus initialization */
    if (CODEC_I2C_Init(handle->i2cHandle, config->i2cConfig.codecI2CInstance, TLV320AIC3110_I2C_BAUDRATE,
                       config->i2cConfig.codecI2CSourceClock) != (status_t)kStatus_HAL_I2cSuccess)
    {
        return kStatus_Fail;
    }
    /* load tlv320aic3110 register map */
    (void)memcpy(reg_cache, tlv320aic3110_reg, sizeof(tlv320aic3110_reg));

    /* Reset the codec */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RESET, 0x00), ret);
    /*
     * VMID=50K, Enable VREF, AINL, AINR, ADCL and ADCR
     * I2S_IN (bit 0), I2S_OUT (bit 1), DAP (bit 4), DAC (bit 5), ADC (bit 6) are powered on
     */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER1, 0xFE), ret);
    /*
     * Enable DACL, DACR, LOUT1, ROUT1, PLL down, SPKL, SPKR
     */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER2, 0x1F8), ret);
    /*
     * Enable left and right channel input PGA, left and right output mixer
     */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER3, 0x3C), ret);
    /* ADC and DAC uses same clock */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_IFACE2, 0x40), ret);
    /* set data route */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetDataRoute(handle, config->route), ret);
    /* set data protocol */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetProtocol(handle, config->bus), ret);

