jma-phytec/workspace-pcm-073-imxrt11xx/evkmimxrt1170_sai_cm7/codec/fsl_tlv320aic3110.c
    if ((config->masterClock.sysclkSource == kTLV320AIC3110_SysClkSourceInternalPLL))
    {
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetInternalPllConfig(handle, sysclk, config->masterClock.sysclkFreq,
                                                     config->format.sampleRate, config->format.bitWidth),
                         ret);
        sysclk = config->masterClock.sysclkFreq;
    }
    /* set master or slave */
    if (config->master_slave)
    {
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetMasterClock(handle, sysclk, config->format.sampleRate, config->format.bitWidth),
                         ret);
    }
    TLV320AIC3110_SetMasterSlave(handle, config->master_slave);
    /* select left input */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetLeftInput(handle, config->leftInputSource), ret);
    /* select right input */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetRightInput(handle, config->rightInputSource), ret);
    /* speaker power */
    if (config->enableSpeaker)
    {
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleSpeaker, true), ret);
    }

    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ADDCTL1, 0x0C0), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ADDCTL4, 0x40), ret);

    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_BYPASS1, 0x0), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_BYPASS2, 0x0), ret);
    /*
     * ADC volume, 0dB
     */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LADC, 0x1C3), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RADC, 0x1C3), ret);

    /*
     * Digital DAC volume, -15.5dB
     */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LDAC, 0x1E0), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RDAC, 0x1E0), ret);

    /*
     * Headphone volume, LOUT1 and ROUT1, -10dB
     */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LOUT1, 0x16F), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ROUT1, 0x16F), ret);

    /* speaker volume 6dB */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LOUT2, 0x1ff), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ROUT2, 0x1ff), ret);
    /* enable class D output */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_CLASSD1, 0xf7), ret);

    /* Unmute DAC. */
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_DACCTL1, 0x0000), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LINVOL, 0x117), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RINVOL, 0x117), ret);

    TLV320AIC3110_CHECK_RET(TLV320AIC3110_ConfigDataFormat(handle, sysclk, config->format.sampleRate, config->format.bitWidth), ret);

    return ret;
}

status_t TLV320AIC3110_Deinit(tlv320aic3110_handle_t *handle)
{
    status_t ret = kStatus_Success;

    TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleADC, false), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleDAC, false), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleVREF, false), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleLineIn, false), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleLineOut, false), ret);
    TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleSpeaker, false), ret);
    TLV320AIC3110_CHECK_RET(CODEC_I2C_Deinit(handle->i2cHandle), ret);

    return ret;
}

void TLV320AIC3110_SetMasterSlave(tlv320aic3110_handle_t *handle, bool master)
{
    if (master)
    {
        (void)TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_IFACE1, TLV320AIC3110_IFACE1_MS_MASK, TLV320AIC3110_IFACE1_MS(TLV320AIC3110_IFACE1_MASTER));
    }
    else
    {
        (void)TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_IFACE1, TLV320AIC3110_IFACE1_MS_MASK, TLV320AIC3110_IFACE1_MS(TLV320AIC3110_IFACE1_SLAVE));
    }
}

status_t TLV320AIC3110_SetModule(tlv320aic3110_handle_t *handle, tlv320aic3110_module_t module, bool isEnabled)
{
    status_t ret = kStatus_Success;
    switch (module)
    {
        case kTLV320AIC3110_ModuleADC:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER1, TLV320AIC3110_POWER1_ADCL_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER1_ADCL_SHIFT)),
                             ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER1, TLV320AIC3110_POWER1_ADCR_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER1_ADCR_SHIFT)),
                             ret);
            break;
        case kTLV320AIC3110_ModuleDAC:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER2, TLV320AIC3110_POWER2_DACL_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER2_DACL_SHIFT)),
                             ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER2, TLV320AIC3110_POWER2_DACR_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER2_DACR_SHIFT)),
                             ret);
            break;
        case kTLV320AIC3110_ModuleVREF:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER1, TLV320AIC3110_POWER1_VREF_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER1_VREF_SHIFT)),
                             ret);
            break;
        case kTLV320AIC3110_ModuleLineIn:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER1, TLV320AIC3110_POWER1_AINL_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER1_AINL_SHIFT)),
                             ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER1, TLV320AIC3110_POWER1_AINR_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER1_AINR_SHIFT)),
                             ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER3, TLV320AIC3110_POWER3_LMIC_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER3_LMIC_SHIFT)),
                             ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER3, TLV320AIC3110_POWER3_RMIC_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER3_RMIC_SHIFT)),
                             ret);
            break;
        case kTLV320AIC3110_ModuleLineOut:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER2, TLV320AIC3110_POWER2_LOUT1_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER2_LOUT1_SHIFT)),
                             ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER2, TLV320AIC3110_POWER2_ROUT1_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER2_ROUT1_SHIFT)),
                             ret);
            break;
        case kTLV320AIC3110_ModuleMICB:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER1, TLV320AIC3110_POWER1_MICB_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER1_MICB_SHIFT)),
                             ret);
            break;
        case kTLV320AIC3110_ModuleSpeaker:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER2, TLV320AIC3110_POWER2_SPKL_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER2_SPKL_SHIFT)),
                             ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER2, TLV320AIC3110_POWER2_SPKR_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER2_SPKR_SHIFT)),
                             ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_CLASSD1, 0xF7), ret);
            break;
        case kTLV320AIC3110_ModuleOMIX:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER3, TLV320AIC3110_POWER3_LOMIX_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER3_LOMIX_SHIFT)),
                             ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_POWER3, TLV320AIC3110_POWER3_ROMIX_MASK,
                                              ((uint16_t)isEnabled << TLV320AIC3110_POWER3_ROMIX_SHIFT)),
                             ret);
            break;
        default:
            ret = kStatus_InvalidArgument;
            break;
    }
    return ret;
}

status_t TLV320AIC3110_SetDataRoute(tlv320aic3110_handle_t *handle, tlv320aic3110_route_t route)
{
    status_t ret = kStatus_Success;
    switch (route)
    {
        case kTLV320AIC3110_RouteBypass:
            /* Bypass means from line-in to HP*/
            /*
             * Left LINPUT3 to left output mixer, LINPUT3 left output mixer volume = 0dB
             */
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LOUTMIX, 0x80), ret);

