jma-phytec/workspace-pcm-073-imxrt11xx/evkmimxrt1170_sai_cm7/codec/fsl_tlv320aic3110.c
            /*
             * Right RINPUT3 to right output mixer, RINPUT3 right output mixer volume = 0dB
             */
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ROUTMIX, 0x80), ret);
            break;
        case kTLV320AIC3110_RoutePlayback:
            /* Data route I2S_IN-> DAC-> HP */
            /*
             * Left DAC to left output mixer, LINPUT3 left output mixer volume = 0dB
             */
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LOUTMIX, 0x100), ret);

            /*
             * Right DAC to right output mixer, RINPUT3 right output mixer volume = 0dB
             */
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ROUTMIX, 0x100), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER3, 0x0C), ret);
            /* Set power for DAC */
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleDAC, true), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleOMIX, true), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleLineOut, true), ret);
            break;
        case kTLV320AIC3110_RoutePlaybackandRecord:
            /*
             * Left DAC to left output mixer, LINPUT3 left output mixer volume = 0dB
             */
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LOUTMIX, 0x100), ret);

            /*
             * Right DAC to right output mixer, RINPUT3 right output mixer volume = 0dB
             */
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ROUTMIX, 0x100), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER3, 0x3C), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleDAC, true), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleADC, true), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleLineIn, true), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleOMIX, true), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleLineOut, true), ret);
            break;
        case kTLV320AIC3110_RouteRecord:
            /* LINE_IN->ADC->I2S_OUT */
            /*
             * Left and right input boost, LIN3BOOST and RIN3BOOST = 0dB
             */
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER3, 0x30), ret);
            /* Power up ADC and AIN */
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleLineIn, true), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_SetModule(handle, kTLV320AIC3110_ModuleADC, true), ret);
            break;
        default:
            ret = kStatus_InvalidArgument;
            break;
    }
    return ret;
}

status_t TLV320AIC3110_SetLeftInput(tlv320aic3110_handle_t *handle, tlv320aic3110_input_t input)
{
    status_t ret = kStatus_Success;
    uint16_t val = 0;

    switch (input)
    {
        case kTLV320AIC3110_InputClosed:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_POWER1, &val), ret);
            val &= (uint16_t) ~(TLV320AIC3110_POWER1_AINL_MASK | TLV320AIC3110_POWER1_ADCL_MASK);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER1, val), ret);
            break;
        case kTLV320AIC3110_InputSingleEndedMic:
            /* Only LMN1 enabled, LMICBOOST to 13db, LMIC2B enabled */
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_POWER1, &val), ret);
            val |= (TLV320AIC3110_POWER1_AINL_MASK | TLV320AIC3110_POWER1_ADCL_MASK | TLV320AIC3110_POWER1_MICB_MASK);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER1, val), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LINPATH, 0x138), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LINVOL, 0x117), ret);
            break;
        case kTLV320AIC3110_InputDifferentialMicInput2:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_POWER1, &val), ret);
            val |= (TLV320AIC3110_POWER1_AINL_MASK | TLV320AIC3110_POWER1_ADCL_MASK | TLV320AIC3110_POWER1_MICB_MASK);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER1, val), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LINPATH, 0x178), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LINVOL, 0x117), ret);
            break;
        case kTLV320AIC3110_InputDifferentialMicInput3:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_POWER1, &val), ret);
            val |= (TLV320AIC3110_POWER1_AINL_MASK | TLV320AIC3110_POWER1_ADCL_MASK | TLV320AIC3110_POWER1_MICB_MASK);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER1, val), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LINPATH, 0x1B8), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LINVOL, 0x117), ret);
            break;
        case kTLV320AIC3110_InputLineINPUT2:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_POWER1, &val), ret);
            val |= (TLV320AIC3110_POWER1_AINL_MASK | TLV320AIC3110_POWER1_ADCL_MASK);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER1, val), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_INBMIX1, &val), ret);
            val |= 0xEU;
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_INBMIX1, val), ret);
            break;
        case kTLV320AIC3110_InputLineINPUT3:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_POWER1, &val), ret);
            val |= (TLV320AIC3110_POWER1_AINL_MASK | TLV320AIC3110_POWER1_ADCL_MASK);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER1, val), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_INBMIX1, &val), ret);
            val |= 0x70U;
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_INBMIX1, val), ret);
            break;
        default:
            ret = kStatus_InvalidArgument;
            break;
    }

    return ret;
}

status_t TLV320AIC3110_SetRightInput(tlv320aic3110_handle_t *handle, tlv320aic3110_input_t input)
{
    status_t ret = kStatus_Success;
    uint16_t val = 0;

