jma-phytec/workspace-pcm-073-imxrt11xx/evkmimxrt1170_sai_cm7/codec/fsl_tlv320aic3110.c
    switch (input)
    {
        case kTLV320AIC3110_InputClosed:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_POWER1, &val), ret);
            val &= (uint16_t) ~(TLV320AIC3110_POWER1_AINR_MASK | TLV320AIC3110_POWER1_ADCR_MASK);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER1, val), ret);
            break;
        case kTLV320AIC3110_InputSingleEndedMic:
            /* Only LMN1 enabled, LMICBOOST to 13db, LMIC2B enabled */
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_POWER1, &val), ret);
            val |= (TLV320AIC3110_POWER1_AINR_MASK | TLV320AIC3110_POWER1_ADCR_MASK | TLV320AIC3110_POWER1_MICB_MASK);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER1, val), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RINPATH, 0x138), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RINVOL, 0x117), ret);
            break;
        case kTLV320AIC3110_InputDifferentialMicInput2:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_POWER1, &val), ret);
            val |= (TLV320AIC3110_POWER1_AINR_MASK | TLV320AIC3110_POWER1_ADCR_MASK | TLV320AIC3110_POWER1_MICB_MASK);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER1, val), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RINPATH, 0x178), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RINVOL, 0x117), ret);
            break;
        case kTLV320AIC3110_InputDifferentialMicInput3:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_POWER1, &val), ret);
            val |= (TLV320AIC3110_POWER1_AINR_MASK | TLV320AIC3110_POWER1_ADCR_MASK | TLV320AIC3110_POWER1_MICB_MASK);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER1, val), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RINPATH, 0x1B8), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RINVOL, 0x117), ret);
            break;
        case kTLV320AIC3110_InputLineINPUT2:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_POWER1, &val), ret);
            val |= (TLV320AIC3110_POWER1_AINR_MASK | TLV320AIC3110_POWER1_ADCR_MASK);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER1, val), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_INBMIX2, &val), ret);
            val |= 0xEU;
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_INBMIX2, val), ret);
            break;
        case kTLV320AIC3110_InputLineINPUT3:
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_POWER1, &val), ret);
            val |= (TLV320AIC3110_POWER1_AINR_MASK | TLV320AIC3110_POWER1_ADCR_MASK);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_POWER1, val), ret);
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_ReadReg(TLV320AIC3110_INBMIX2, &val), ret);
            val |= 0x70U;
            TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_INBMIX2, val), ret);
            break;
        default:
            ret = kStatus_InvalidArgument;
            break;
    }

    return ret;
}

status_t TLV320AIC3110_SetProtocol(tlv320aic3110_handle_t *handle, tlv320aic3110_protocol_t protocol)
{
    return TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_IFACE1, TLV320AIC3110_IFACE1_FORMAT_MASK | TLV320AIC3110_IFACE1_LRP_MASK,
                            (uint16_t)protocol);
}

status_t TLV320AIC3110_SetVolume(tlv320aic3110_handle_t *handle, tlv320aic3110_module_t module, uint32_t volume)
{
    uint16_t vol = 0;
    status_t ret = kStatus_Success;
    switch (module)
    {
        case kTLV320AIC3110_ModuleADC:
            if (volume > 255U)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LADC, vol), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RADC, vol), ret);
                /* Update volume */
                vol = (uint16_t)(0x100U | volume);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LADC, vol), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RADC, vol), ret);
            }
            break;
        case kTLV320AIC3110_ModuleDAC:
            if (volume > 255U)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LDAC, vol), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RDAC, vol), ret);
                vol = 0x100U | (uint16_t)volume;
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LDAC, vol), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RDAC, vol), ret);
            }
            break;
        case kTLV320AIC3110_ModuleHP:
            if (volume > 0x7FU)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LOUT1, vol), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ROUT1, vol), ret);
                vol = 0x100U | (uint16_t)volume;
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LOUT1, vol), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ROUT1, vol), ret);
            }
            break;
        case kTLV320AIC3110_ModuleLineIn:
            if (volume > 0x3FU)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LINVOL, vol), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RINVOL, vol), ret);
                vol = 0x100U | (uint16_t)volume;
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LINVOL, vol), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RINVOL, vol), ret);
            }
            break;
        case kTLV320AIC3110_ModuleSpeaker:
            if (volume > 0x7FU)
            {
                ret = kStatus_InvalidArgument;
            }
            else
            {
                vol = (uint16_t)volume;
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LOUT2, vol), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ROUT2, vol), ret);
                vol = 0x100U | (uint16_t)volume;
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LOUT2, vol), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ROUT2, vol), ret);
            }
            break;
        default:
            ret = kStatus_InvalidArgument;
            break;
    }
    return ret;
}

