jma-phytec/workspace-pcm-073-imxrt11xx/evkmimxrt1170_sai_cm7/codec/fsl_tlv320aic3110.c
uint32_t TLV320AIC3110_GetVolume(tlv320aic3110_handle_t *handle, tlv320aic3110_module_t module)
{
    uint16_t vol = 0;

    switch (module)
    {
        case kTLV320AIC3110_ModuleADC:
            (void)TLV320AIC3110_ReadReg(TLV320AIC3110_LADC, &vol);
            vol &= 0xFFU;
            break;
        case kTLV320AIC3110_ModuleDAC:
            (void)TLV320AIC3110_ReadReg(TLV320AIC3110_LDAC, &vol);
            vol &= 0xFFU;
            break;
        case kTLV320AIC3110_ModuleHP:
            (void)TLV320AIC3110_ReadReg(TLV320AIC3110_LOUT1, &vol);
            vol &= 0x7FU;
            break;
        case kTLV320AIC3110_ModuleLineOut:
            (void)TLV320AIC3110_ReadReg(TLV320AIC3110_LINVOL, &vol);
            vol &= 0x3FU;
            break;
        default:
            vol = 0;
            break;
    }
    return vol;
}

status_t TLV320AIC3110_SetMute(tlv320aic3110_handle_t *handle, tlv320aic3110_module_t module, bool isEnabled)
{
    status_t ret = kStatus_Success;
    switch (module)
    {
        case kTLV320AIC3110_ModuleADC:
            /*
             * Digital Mute
             */
            if (isEnabled)
            {
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LADC, 0x100), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RADC, 0x100), ret);
            }
            else
            {
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LADC, 0x1C3), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RADC, 0x1C3), ret);
            }
            break;
        case kTLV320AIC3110_ModuleDAC:
            /*
             * Digital mute
             */
            if (isEnabled)
            {
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LDAC, 0x100), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RDAC, 0x100), ret);
            }
            else
            {
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LDAC, 0x1FF), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_RDAC, 0x1FF), ret);
            }
            break;
        case kTLV320AIC3110_ModuleHP:
            /*
             * Analog mute
             */
            if (isEnabled)
            {
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LOUT1, 0x100), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ROUT1, 0x100), ret);
            }
            else
            {
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LOUT1, 0x16F), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ROUT1, 0x16F), ret);
            }
            break;

        case kTLV320AIC3110_ModuleSpeaker:
            if (isEnabled)
            {
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LOUT2, 0x100), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ROUT2, 0x100), ret);
            }
            else
            {
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_LOUT2, 0x16F), ret);
                TLV320AIC3110_CHECK_RET(TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ROUT2, 0x16f), ret);
            }
            break;

        case kTLV320AIC3110_ModuleLineOut:
            break;
        default:
            ret = kStatus_InvalidArgument;
            break;
    }
    return ret;
}

status_t TLV320AIC3110_ConfigDataFormat(tlv320aic3110_handle_t *handle, uint32_t sysclk, uint32_t sample_rate, uint32_t bits)
{
    status_t retval  = kStatus_Success;
    uint32_t divider = 0;
    uint16_t val     = 0;

    /* Compute sample rate divider, dac and adc are the same sample rate */
    divider = sysclk / sample_rate;
    if (divider == 256U)
    {
        val = 0;
    }
    else if (divider > 256U)
    {
        val = (uint16_t)(((divider / 256U) << 6U) | ((divider / 256U) << 3U));
    }
    else
    {
        return kStatus_InvalidArgument;
    }

    retval = TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_CLOCK1, 0x1F8U, val);
    if (retval != kStatus_Success)
    {
        return retval;
    }

    /*
     * Slave mode (MS = 0), LRP = 0, 32bit WL, left justified (FORMAT[1:0]=0b01)
     */
    switch (bits)
    {
        case 16:
            retval = TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_IFACE1, TLV320AIC3110_IFACE1_WL_MASK,
                                      TLV320AIC3110_IFACE1_WL(TLV320AIC3110_IFACE1_WL_16BITS));
            break;
        case 20:
            retval = TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_IFACE1, TLV320AIC3110_IFACE1_WL_MASK,
                                      TLV320AIC3110_IFACE1_WL(TLV320AIC3110_IFACE1_WL_20BITS));
            break;
        case 24:
            retval = TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_IFACE1, TLV320AIC3110_IFACE1_WL_MASK,
                                      TLV320AIC3110_IFACE1_WL(TLV320AIC3110_IFACE1_WL_24BITS));
            break;
        case 32:
            retval = TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_IFACE1, TLV320AIC3110_IFACE1_WL_MASK,
                                      TLV320AIC3110_IFACE1_WL(TLV320AIC3110_IFACE1_WL_32BITS));
            break;
        default:
            retval = kStatus_InvalidArgument;
            break;
    }

    return retval;
}

status_t TLV320AIC3110_SetJackDetect(tlv320aic3110_handle_t *handle, bool isEnabled)
{
    status_t retval = 0;
    uint16_t val    = 0;

    if (TLV320AIC3110_ReadReg(TLV320AIC3110_ADDCTL2, &val) != kStatus_Success)
    {
        return kStatus_Fail;
    }

    if (isEnabled)
    {
        val |= 0x40U;
    }
    else
    {
        val &= 0xCFU;
    }

    retval = TLV320AIC3110_WriteReg(handle, TLV320AIC3110_ADDCTL2, val);

    return retval;
}

status_t TLV320AIC3110_WriteReg(tlv320aic3110_handle_t *handle, uint8_t reg, uint16_t val)
{
    uint8_t cmd;
    uint8_t buff = (uint8_t)val & 0xFFU;

    /* The register address */
    cmd = (reg << 1U) | (uint8_t)((val >> 8U) & 0x0001U);

    reg_cache[reg] = val;

