jma-phytec/workspace-pcm-073-imxrt11xx/evkmimxrt1170_sai_cm7/codec/fsl_tlv320aic3110.c
    return CODEC_I2C_Send(handle->i2cHandle, handle->config->slaveAddress, cmd, 1U, &buff, 1U);
}

status_t TLV320AIC3110_ReadReg(uint8_t reg, uint16_t *val)
{
    if (reg >= TLV320AIC3110_CACHEREGNUM)
    {
        return kStatus_InvalidArgument;
    }

    *val = reg_cache[reg];

    return kStatus_Success;
}

status_t TLV320AIC3110_ModifyReg(tlv320aic3110_handle_t *handle, uint8_t reg, uint16_t mask, uint16_t val)
{
    status_t retval  = 0;
    uint16_t reg_val = 0;
    retval           = TLV320AIC3110_ReadReg(reg, &reg_val);
    if (retval != kStatus_Success)
    {
        return kStatus_Fail;
    }
    reg_val &= (uint16_t)~mask;
    reg_val |= val;
    retval = TLV320AIC3110_WriteReg(handle, reg, reg_val);
    if (retval != kStatus_Success)
    {
        return kStatus_Fail;
    }
    return kStatus_Success;
}

status_t TLV320AIC3110_SetPlay(tlv320aic3110_handle_t *handle, uint32_t playSource)
{
    status_t ret = kStatus_Success;

    if (((uint32_t)kTLV320AIC3110_PlaySourcePGA & playSource) != 0U)
    {
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_BYPASS1, 0x80U, 0x80U), ret);
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_BYPASS2, 0x80U, 0x80U), ret);
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_LOUTMIX, 0x180U, 0U), ret);
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_ROUTMIX, 0x180U, 0U), ret);
    }

    if ((playSource & (uint32_t)kTLV320AIC3110_PlaySourceDAC) != 0U)
    {
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_BYPASS1, 0x80U, 0x00U), ret);
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_BYPASS2, 0x80U, 0x00U), ret);
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_LOUTMIX, 0x180U, 0x100U), ret);
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_ROUTMIX, 0x180U, 0x100U), ret);
    }

    if ((playSource & (uint32_t)kTLV320AIC3110_PlaySourceInput) != 0U)
    {
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_BYPASS1, 0x80U, 0x0U), ret);
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_BYPASS2, 0x80U, 0x0U), ret);
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_LOUTMIX, 0x180U, 0x80U), ret);
        TLV320AIC3110_CHECK_RET(TLV320AIC3110_ModifyReg(handle, TLV320AIC3110_ROUTMIX, 0x180U, 0x80U), ret);
    }

    return ret;
}
